class Extra:
    @staticmethod
    def iniciar():
        # Método estático que imprime a tela inicial do jogo com arte ASCII
        print("""
 ██                                     ██               ██                                                                  
░██                                    ░░               ░██                                                                  
░██       █████  ██████████    ██    ██ ██ ███████      ░██  ██████     ██████    ██████                                     
░██████  ██░░░██░░██░░██░░██  ░██   ░██░██░░██░░░██  ██████ ██░░░░██   ░░░░░░██  ██░░░░██                                    
░██░░░██░███████ ░██ ░██ ░██  ░░██ ░██ ░██ ░██  ░██ ██░░░██░██   ░██    ███████ ░██   ░██                                    
░██  ░██░██░░░░  ░██ ░██ ░██   ░░████  ░██ ░██  ░██░██  ░██░██   ░██   ██░░░░██ ░██   ░██                                    
░██████ ░░██████ ███ ░██ ░██    ░░██   ░██ ███  ░██░░██████░░██████   ░░████████░░██████                                     
░░░░░    ░░░░░░ ░░░  ░░  ░░      ░░    ░░ ░░░   ░░  ░░░░░░  ░░░░░░     ░░░░░░░░  ░░░░░░                                      
   ██                                  ██                                                                 ██                 
  ░██                                 ░░                                                                 ░██                 
 ██████  █████  ██████  █████   █████  ██ ██████  ██████     ██████  █████  ██████████   █████   ██████ ██████ ██████  █████ 
░░░██░  ██░░░██░░██░░█ ██░░░██ ██░░░██░██░░██░░█ ██░░░░██   ██░░░░  ██░░░██░░██░░██░░██ ██░░░██ ██░░░░ ░░░██░ ░░██░░█ ██░░░██
  ░██  ░███████ ░██ ░ ░██  ░░ ░███████░██ ░██ ░ ░██   ░██  ░░█████ ░███████ ░██ ░██ ░██░███████░░█████   ░██   ░██ ░ ░███████
  ░██  ░██░░░░  ░██   ░██   ██░██░░░░ ░██ ░██   ░██   ░██   ░░░░░██░██░░░░  ░██ ░██ ░██░██░░░░  ░░░░░██  ░██   ░██   ░██░░░░ 
  ░░██ ░░██████░███   ░░█████ ░░██████░██░███   ░░██████    ██████ ░░██████ ███ ░██ ░██░░██████ ██████   ░░██ ░███   ░░██████
   ░░   ░░░░░░ ░░░     ░░░░░   ░░░░░░ ░░ ░░░     ░░░░░░    ░░░░░░   ░░░░░░ ░░░  ░░  ░░  ░░░░░░ ░░░░░░     ░░  ░░░     ░░░░░░ 
        """)
        print("--------------TERCEIRO SEMESTRE --------------\n")

    @staticmethod
    def creditos():
        # Método estático que imprime os créditos do jogo
        print("\nGRUPO:\nFernanda Vaz\nRaphael Borges\n")
        print("PROFESSOR: Gabriela Nunes\n")

    @staticmethod
    def reprovacao():
        # Método estático que imprime a mensagem de reprovação e encerra o jogo
        print("Que pena! parece que voce reprovou nessa materia...")
        print("Infelizmente isso te desmotivou muito e voce acabou trancando o semestre, tente de novo no proximo!\n")
        exit(0)

    @staticmethod
    def print_a():
        # Método estático que imprime um A em arte ASCII
        print("""
 .----------------. 
| .--------------. |
| |      __      | |
| |     /  \     | |
| |    / /\ \    | |
| |   / ____ \   | |
| | _/ /    \ \_ | |
| ||____|  |____|| |
| |              | |
| '--------------' |
 '----------------' 
        """)

    @staticmethod
    def print_b():
        # Método estático que imprime um B em arte ASCII
        print("""
 .----------------. 
| .--------------. |
| |   ______     | |
| |  |_   _ \    | |
| |    | |_) |   | |
| |    |  __'.   | |
| |   _| |__) |  | |
| |  |_______/   | |
| |              | |
| '--------------' |
 '----------------' 
        """)

    @staticmethod
    def print_c():
        # Método estático que imprime um C em arte ASCII
        print("""
 .----------------. 
| .--------------. |
| |     ______   | |
| |   .' ___  |  | |
| |  / .'   \_|  | |
| |  | |         | |
| |  \ `.___.'\  | |
| |   `._____.'  | |
| |              | |
| '--------------' |
 '----------------' 
        """)

    @staticmethod
    def print_d():
        # Método estático que imprime um D em arte ASCII
        print("""
 .----------------. 
| .--------------. |
| |  ________    | |
| | |_   ___ `.  | |
| |   | |   `. \ | |
| |   | |    | | | |
| |  _| |___.' / | |
| | |________.'  | |
| |              | |
| '--------------' |
 '----------------' 
        """)

    @staticmethod
    def print_e():
        # Método estático que imprime um E em arte ASCII
        print("""
 .----------------. 
| .--------------. |
| |   _______    | |
| |  |   ____|   | |
| |  |  |__      | |
| |  |   __|     | |
| |  |  |____    | |
| |  |_______|   | |
| |              | |
| '--------------' |
 '----------------' 


        """)
